import { createIcon } from "../createIcon";

export const IconPlus = createIcon({
    content:(
        <>
        {/* M853.333333 480命令将绘图光标移动到坐标(853.333333, 480)，然后H544命令绘制一条从当前位置到x坐标为544的水平线。V170.666667命令绘制一条从当前位置到y坐标为170.666667的垂直线。
        c0-17.066667-14.933333-32-32-32s-32 14.933333-32 32是一个贝塞尔曲线命令，用于绘制曲线。最后，z命令关闭路径，返回到路径的起始点。 */}
            <path d="M853.333333 480H544V170.666667c0-17.066667-14.933333-32-32-32s-32 14.933333-32 32v309.333333H170.666667c-17.066667 0-32 14.933333-32 32s14.933333 32 32 32h309.333333V853.333333c0 17.066667 14.933333 32 32 32s32-14.933333 32-32V544H853.333333c17.066667 0 32-14.933333 32-32s-14.933333-32-32-32z"></path>
        </>
    )
})